Revit 2027 API
FaceArrayIterator Class
An iterator to a face array.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FaceArrayIterator
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public abstract class FaceArrayIterator : APIObject,
	IEnumerator
Public MustInherit Class FaceArrayIterator
	Inherits APIObject
	Implements IEnumerator
public ref class FaceArrayIterator abstract : public APIObject,
	IEnumerator
[<AbstractClassAttribute>]
type FaceArrayIterator =
    class
        inherit APIObject
        interface IEnumerator
    end
The FaceArrayIterator type exposes the following members.
Constructors
Name | Description
FaceArrayIterator | For Internal Use Only.
Top
Properties
Name | Description
Current | Retrieves the item that is the current focus of the iterator.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Top
Methods
Name | Description
Dispose | Causes the object to release immediately any resources it may be utilizing.
(Inherited from APIObject)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
MoveNext | Move the iterator one item forward.
Reset | Bring the iterator back to the start of the array.
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB Namespace